; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v5 ?v9)
             (pred_4 ?v1 ?v6)
             (pred_6 ?v5 ?v6)
             (pred_10 ?v10 ?v5 )
	     (pred_8 ?v5)
             (pred_2 ?v12)
             (pred_7 ?v1)
             (pred_3 ?v6)
             (pred_11 ?v5)
             (pred_5 ?v1)
             (pred_9 ?v5)
             (pred_12 ))



(:action op_3
:parameters (?v13 ?v11 ?v2 ?v8)
:precondition (and (pred_2 ?v13) (pred_2 ?v11) (pred_7 ?v2) (pred_3 ?v8)
          (pred_1 ?v13 ?v11) (pred_4 ?v2 ?v8)
                   (pred_6 ?v11 ?v8) (pred_8 ?v13) 
                   (pred_11 ?v11) (pred_5 ?v2))
:effect (and  (pred_9 ?v11) (not (pred_11 ?v11))))


(:action op_1
:parameters (?v13 ?v4)
:precondition (and (pred_2 ?v13) (pred_2 ?v4)
               (pred_8 ?v13) (pred_1 ?v13 ?v4) (pred_9 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v13))))

(:action op_5
:parameters (?v13 ?v2)
:precondition (and (pred_2 ?v13) (pred_7 ?v2) 
                  (pred_8 ?v13) (pred_10 ?v2 ?v13) (pred_12 ))
:effect (and (pred_5 ?v2)
   (not (pred_10 ?v2 ?v13)) (not (pred_12 ))))


(:action op_4
:parameters (?v13 ?v3 ?v7)
:precondition (and (pred_2 ?v13) (pred_7 ?v3) (pred_7 ?v7)
                  (pred_8 ?v13) (pred_5 ?v7) (pred_10 ?v3 ?v13))
:effect (and (pred_5 ?v3) (pred_10 ?v7 ?v13)
        (not (pred_5 ?v7)) (not (pred_10 ?v3 ?v13))))

(:action op_2
:parameters (?v13 ?v2)
:precondition (and (pred_2 ?v13) (pred_7 ?v2) 
                  (pred_8 ?v13) (pred_5 ?v2))
:effect (and (pred_12 ) (pred_10 ?v2 ?v13) (not (pred_5 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_17 obj_06 obj_08 obj_11 obj_13 obj_09 obj_20 obj_30 obj_27 obj_10 obj_22 obj_25 obj_28 obj_18 obj_24 obj_16 obj_31 obj_05 obj_03 obj_07 obj_12 obj_01 obj_02 obj_14
    obj_21 obj_26 obj_15
    obj_04 obj_19 obj_29
    )

    (:init
       (pred_12)

       (pred_2 obj_23)
       (pred_2 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_2 obj_13)
       (pred_2 obj_09)
       (pred_2 obj_20)
       (pred_2 obj_30)
       (pred_2 obj_27)
       (pred_2 obj_10)
       (pred_2 obj_22)
       (pred_2 obj_25)
       (pred_2 obj_28)
       (pred_2 obj_18)
       (pred_2 obj_24)
       (pred_2 obj_16)
       (pred_2 obj_31)
       (pred_2 obj_05)
       (pred_2 obj_03)
       (pred_2 obj_07)
       (pred_2 obj_12)
       (pred_2 obj_01)
       (pred_2 obj_02)
       (pred_2 obj_14)
       (pred_3 obj_21)
       (pred_3 obj_26)
       (pred_3 obj_15)
       (pred_7 obj_04)
       (pred_7 obj_19)
       (pred_7 obj_29)

       (pred_1 obj_23 obj_13)
       (pred_1 obj_23 obj_17)
       (pred_1 obj_17 obj_09)
       (pred_1 obj_17 obj_06)
       (pred_1 obj_17 obj_23)
       (pred_1 obj_06 obj_20)
       (pred_1 obj_06 obj_08)
       (pred_1 obj_06 obj_17)
       (pred_1 obj_08 obj_30)
       (pred_1 obj_08 obj_11)
       (pred_1 obj_08 obj_06)
       (pred_1 obj_11 obj_27)
       (pred_1 obj_11 obj_08)
       (pred_1 obj_13 obj_10)
       (pred_1 obj_13 obj_09)
       (pred_1 obj_13 obj_23)
       (pred_1 obj_09 obj_22)
       (pred_1 obj_09 obj_20)
       (pred_1 obj_09 obj_17)
       (pred_1 obj_09 obj_13)
       (pred_1 obj_20 obj_25)
       (pred_1 obj_20 obj_30)
       (pred_1 obj_20 obj_06)
       (pred_1 obj_20 obj_09)
       (pred_1 obj_30 obj_28)
       (pred_1 obj_30 obj_27)
       (pred_1 obj_30 obj_08)
       (pred_1 obj_30 obj_20)
       (pred_1 obj_27 obj_18)
       (pred_1 obj_27 obj_11)
       (pred_1 obj_27 obj_30)
       (pred_1 obj_10 obj_24)
       (pred_1 obj_10 obj_22)
       (pred_1 obj_10 obj_13)
       (pred_1 obj_22 obj_16)
       (pred_1 obj_22 obj_25)
       (pred_1 obj_22 obj_09)
       (pred_1 obj_22 obj_10)
       (pred_1 obj_25 obj_31)
       (pred_1 obj_25 obj_28)
       (pred_1 obj_25 obj_20)
       (pred_1 obj_25 obj_22)
       (pred_1 obj_28 obj_05)
       (pred_1 obj_28 obj_18)
       (pred_1 obj_28 obj_30)
       (pred_1 obj_28 obj_25)
       (pred_1 obj_18 obj_03)
       (pred_1 obj_18 obj_27)
       (pred_1 obj_18 obj_28)
       (pred_1 obj_24 obj_07)
       (pred_1 obj_24 obj_16)
       (pred_1 obj_24 obj_10)
       (pred_1 obj_16 obj_12)
       (pred_1 obj_16 obj_31)
       (pred_1 obj_16 obj_22)
       (pred_1 obj_16 obj_24)
       (pred_1 obj_31 obj_01)
       (pred_1 obj_31 obj_05)
       (pred_1 obj_31 obj_25)
       (pred_1 obj_31 obj_16)
       (pred_1 obj_05 obj_02)
       (pred_1 obj_05 obj_03)
       (pred_1 obj_05 obj_28)
       (pred_1 obj_05 obj_31)
       (pred_1 obj_03 obj_14)
       (pred_1 obj_03 obj_18)
       (pred_1 obj_03 obj_05)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_07 obj_24)
       (pred_1 obj_12 obj_01)
       (pred_1 obj_12 obj_16)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_01 obj_31)
       (pred_1 obj_01 obj_12)
       (pred_1 obj_02 obj_14)
       (pred_1 obj_02 obj_05)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_14 obj_03)
       (pred_1 obj_14 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_01)
       (pred_11 obj_22)
       (pred_6  obj_11 obj_21)
       (pred_6  obj_01 obj_26)
       (pred_6  obj_22 obj_15)
       (pred_9 obj_23)
       (pred_9 obj_17)
       (pred_9 obj_06)
       (pred_9 obj_08)
       (pred_9 obj_13)
       (pred_9 obj_09)
       (pred_9 obj_20)
       (pred_9 obj_30)
       (pred_9 obj_27)
       (pred_9 obj_10)
       (pred_9 obj_25)
       (pred_9 obj_28)
       (pred_9 obj_18)
       (pred_9 obj_24)
       (pred_9 obj_16)
       (pred_9 obj_31)
       (pred_9 obj_05)
       (pred_9 obj_03)
       (pred_9 obj_07)
       (pred_9 obj_12)
       (pred_9 obj_02)
       (pred_9 obj_14)

       (pred_4  obj_04 obj_21)
       (pred_4  obj_19 obj_26)
       (pred_4  obj_29 obj_15)
       (pred_10 obj_04 obj_13)
       (pred_10 obj_19 obj_24)
       (pred_10 obj_29 obj_12)
       (pred_8 obj_07)
    )

    (:goal (and
       (pred_10 obj_29 obj_17)
    ))
(:constraints
  (always (not (pred_8 obj_16)))
)
)

; plan
1. (op_1 obj_07 obj_12)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_12)
   goals met: 0 of 1
2. (op_5 obj_12 obj_29)
   deleted: (pred_10 obj_29 obj_12) (pred_12)
   added: (pred_5 obj_29)
   goals met: 0 of 1
3. (op_1 obj_12 obj_07)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_07)
   goals met: 0 of 1
4. (op_1 obj_07 obj_24)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_24)
   goals met: 0 of 1
5. (op_1 obj_24 obj_10)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_10)
   goals met: 0 of 1
6. (op_1 obj_10 obj_13)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_13)
   goals met: 0 of 1
7. (op_1 obj_13 obj_23)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_23)
   goals met: 0 of 1
8. (op_1 obj_23 obj_17)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_17)
   goals met: 0 of 1
9. (op_2 obj_17 obj_29)
   deleted: (pred_5 obj_29)
   added: (pred_12) (pred_10 obj_29 obj_17)
   goals met: 1 of 1
